package Course1.Lessons.Lesson3;

public class Test3_4 {
    public static void main(String[] args) {

      /*  int a = 3;
        int b = 5;*/
        // операторы <; >; <=; >=; ==; !=(не равно);


        // логические операторы
        // &&-логическое "и"
        // ||- логическое или
        // ! - логическое отрицание
        // | - логическое или(выполняются все условия)(побитово сравнивают числа (сложение))
        // & - логическое и(выполняются все условия)(побитово сравнивают числа(умножение))
        // ^ - логическое или(выдает true - только когда единственное выражение true, во всех остальных случаях false)
        boolean a = true;
        boolean b = !a;
        System.out.println(b);
    }
}
